<a href="https://colab.research.google.com/github/drewamorbordelon/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/module3-join-and-reshape-data/LS_DS19_113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [3]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2020-08-06 01:46:09--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.217.39.134
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.217.39.134|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.2’

instacart_online_gr 100%[===================>] 196.03M  94.7MB/s    in 2.1s

2020-08-06 01:46:11 (94.7 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.2’ saved [205548478/205548478]

In [4]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [5]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [6]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

##### YOUR CODE HERE #####

import pandas as pd
import numpy as np

dept = pd.read_csv('departments.csv')
dept.head()

orders = pd.read_csv('orders.csv')
orders.head()

products = pd.read_csv('products.csv')
products.head()

order_products_train = pd.read_csv('order_products__train.csv')
order_products_train.head()

NEED:
products = pd.read_csv('products.csv') 
product_id
product_name

orders = pd.read_csv('orders.csv') 
order_id

In [7]:
# looking for the order frequency of top 10 most frequently ordered products

In [8]:
import pandas as pd 
import numpy as np

In [10]:
order_products_train = pd.read_csv('order_products__train.csv')

print(order_products_train.shape)
order_products_train.head()

(1384617, 4)

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [11]:
order_products_prior = pd.read_csv('order_products__prior.csv')

print(order_products_prior.shape)
order_products_prior.head()

(32434489, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [12]:
# Concatenate order_products_prior and order_products_train
# use this later to merge order_id with product_id

order_prod_subset = pd.concat([order_products_prior, order_products_train])

print(order_prod_subset.shape)
order_prod_subset.head()

(33819106, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [13]:
#  products has product_id and product_name
#  will need this later

products = pd.read_csv('products.csv')

print(products.shape)
products.head()

(49688, 4)

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [15]:
print(order_products_prior.shape, " prior")
print(order_products_train.shape, " train")
print(order_prod_subset.shape, " concat_prior_train")

(32434489, 4)  prior
(1384617, 4)  train
(33819106, 4)  concat_prior_train

In [17]:
# orders has order_id
# Will need this 

orders = pd.read_csv('orders.csv') 

print(orders.shape)

orders.head()

(3421083, 7)

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [78]:
# May use this later to write a function

# examples = ['Banana', 'Bag of Organic Bananas', 'Organic Strawberries', 
#             'Organic Baby Spinach', 'Organic Hass Avocado', 'Organic Avocado', 
#             'Large Lemon', 'Strawberries', 'Limes', 'Organic Whole Milk']

SyntaxError: ignored

In [77]:
# products[products['product_name'] == "product_name"

condition = (products['product_name'] 
             =='Banana') | (products['product_name'] 
             == 'Bag of Organic Bananas') | (products['product_name'] 
             == 'Organic Strawberries') | (products['product_name'] 
             == 'Organic Baby Spinach') | (products['product_name'] 
             == 'Organic Hass Avocado')  | (products['product_name'] 
             == 'Organic Avocado') | (products['product_name'] 
             == 'Large Lemon') | (products['product_name'] 
             == 'Strawberries') | (products['product_name'] 
             == 'Limes') | (products['product_name'] 
             == 'Organic Whole Milk')

prod_subset = products[condition]

prod_subset

       product_id            product_name  aisle_id  department_id
13175       13176  Bag of Organic Bananas        24              4
16796       16797            Strawberries        24              4
21136       21137    Organic Strawberries        24              4
21902       21903    Organic Baby Spinach       123              4
24851       24852                  Banana        24              4
26208       26209                   Limes        24              4
27844       27845      Organic Whole Milk        84             16
47208       47209    Organic Hass Avocado        24              4
47625       47626             Large Lemon        24              4
47765       47766         Organic Avocado        24              4

In [27]:
# Merging prod_subset and order_prod_subset

order_prod_id = pd.merge(prod_subset, order_prod_subset, on='product_id', how='inner')

order_prod_id.head()

   product_id            product_name  ...  add_to_cart_order  reordered
0       13176  Bag of Organic Bananas  ...                  1          1
1       13176  Bag of Organic Bananas  ...                  1          1
2       13176  Bag of Organic Bananas  ...                  3          1
3       13176  Bag of Organic Bananas  ...                  3          1
4       13176  Bag of Organic Bananas  ...                  3          1

[5 rows x 7 columns]

In [33]:
final = pd.merge(order_prod_id, orders, on='order_id', how='inner')

final.head()

   product_id  ... days_since_prior_order
0       13176  ...                    9.0
1       47209  ...                    9.0
2       13176  ...                   14.0
3       47766  ...                   14.0
4       13176  ...                   10.0

[5 rows x 13 columns]

In [34]:
final = final.drop(['aisle_id', 'department_id', 'add_to_cart_order', 
                    'reordered', 'user_id', 'eval_set', 'order_number', 
                    'order_hour_of_day','days_since_prior_order'], axis=1)

final

         product_id            product_name  order_id  order_dow
0             13176  Bag of Organic Bananas         5          6
1             47209    Organic Hass Avocado         5          6
2             13176  Bag of Organic Bananas        27          6
3             47766         Organic Avocado        27          6
4             13176  Bag of Organic Bananas        29          5
...             ...                     ...       ...        ...
2418309       47766         Organic Avocado   3416675          0
2418310       47766         Organic Avocado   3417614          0
2418311       47766         Organic Avocado   3418070          1
2418312       47766         Organic Avocado   3420232          0
2418313       47766         Organic Avocado   3420578          5

[2418314 rows x 4 columns]

In [74]:
final = final.sort_values(by='product_id')

final

         product_id            product_name  order_id  order_dow
0             13176  Bag of Organic Bananas         5          6
115060        13176  Bag of Organic Bananas    597797          0
465832        13176  Bag of Organic Bananas   2406626          6
115044        13176  Bag of Organic Bananas    597669          0
524754        13176  Bag of Organic Bananas   2709312          0
...             ...                     ...       ...        ...
2020036       47766         Organic Avocado   3325937          1
1902052       47766         Organic Avocado   2424191          4
2115090       47766         Organic Avocado   2308872          5
730210        47766         Organic Avocado    622640          0
1292389       47766         Organic Avocado   3405199          0

[2418314 rows x 4 columns]

In [71]:
final['product_name'].value_counts()

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

In [72]:
final['product_id'].value_counts()

24852    491291
13176    394930
21137    275577
21903    251705
47209    220877
47766    184224
47626    160792
16797    149445
26209    146660
27845    142813
Name: product_id, dtype: int64

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [83]:
import pandas as pd
import numpy as np

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [88]:
# table2 -> tidy

table2 = table2.reset_index()

table2

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [90]:
#Tidy requires .melt()

tidy = table2.melt(id_vars ='index', value_vars=['Jane Doe', 'John Smith' , 'Mary Johnson'])

tidy

        index      variable  value
0  treatmenta      Jane Doe   16.0
1  treatmentb      Jane Doe   11.0
2  treatmenta    John Smith    NaN
3  treatmentb    John Smith    2.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [97]:
tidy2 = tidy.rename(columns={
    'index': 'Trt',
    'variable': 'Name',
    'value': 'Result'
})

tidy2

          Trt          Name  Result
0  treatmenta      Jane Doe    16.0
1  treatmentb      Jane Doe    11.0
2  treatmenta    John Smith     NaN
3  treatmentb    John Smith     2.0
4  treatmenta  Mary Johnson     3.0
5  treatmentb  Mary Johnson     1.0

In [98]:
# tidy -> table2
#use .pivot_table()

wide = tidy2.pivot_table(index='Trt', , columns='Name', values='Result')

wide

Name        Jane Doe  John Smith  Mary Johnson
Trt
treatmenta      16.0         NaN           3.0
treatmentb      11.0         2.0           1.0

In [100]:
import seaborn as sns

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [102]:
flights = sns.load_dataset('flights')

flights

     year      month  passengers
0    1949    January         112
1    1949   February         118
2    1949      March         132
3    1949      April         129
4    1949        May         121
..    ...        ...         ...
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

[144 rows x 3 columns]

In [103]:
# Flights Pivot Table

flights_pivot_table = flights.pivot_table(index='year', columns='month', values= 'passengers')

flights_pivot_table

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [104]:
##### YOUR CODE HERE #####

from IPython.display import display, Image
url = 'https://cdn-images-1.medium.com/max/1600/1*wKfV6OV-_1Ipwrl7AjjSuw.png'
example = Image(url=url, width=600)

display(example)

In [106]:
products = pd.read_csv('products.csv')

order_products = pd.concat([pd.read_csv('order_products__prior.csv'),
                            pd.read_csv('order_products__train.csv')])

orders = pd.read_csv('orders.csv')

In [111]:
(products[['product_id', 'product_name']]
 .merge(order_))

       product_id  ... department_id
49683       49684  ...             5
49684       49685  ...             1
49685       49686  ...             3
49686       49687  ...             8
49687       49688  ...            11

[5 rows x 4 columns]

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [ ]:
##### YOUR CODE HERE #####